const configs = {
    guide: {
        name: "常用工具",
        id: "guide",

        function: function () {
            toggleSubMenu("guide-submenu"); // Toggle sub-items for this menu
        },
        subItems: {
            rules: {
                name: "游戏规则",
                function: function () {
                    jumpToOther("htmls/rules/rules.html");
                },
            },
            video: {
                name: "视频教学",
                function: function () {
                    jumpToOther("https://www.bilibili.com/video/BV1jKzcYKEFi/");
                },
            },
            deckBuild: {
                name: "构筑卡组",
                function: function () {
                    jumpToOther("https://yifeeeeei.github.io/ArcaneComposer/");
                },
            },
            ttsMod: {
                name: "TTS模组",
                function: function () {
                    jumpToOther(
                        "https://steamcommunity.com/sharedfiles/filedetails/?id=3155709993"
                    );
                },
            },
        },
    },
    premade: {
        name: "预组卡组",
        id: "premade",
        function: function () {
            toggleSubMenu("premade-submenu"); // Toggle sub-items for this menu
        },
        subItems: {
            fire: {
                name: "迅疾如火",
                function: function () {
                    showPremade("迅疾如火");
                },
            },
            water: {
                name: "大海无量",
                function: function () {
                    showPremade("大海无量");
                },
            },
            earth: {
                name: "富饶之地",
                function: function () {
                    showPremade("富饶之地");
                },
            },
            air: {
                name: "风暴之息",
                function: function () {
                    showPremade("风暴之息");
                },
            },
            light: {
                name: "破晓时分",
                function: function () {
                    showPremade("破晓时分");
                },
            },
            dark: {
                name: "暗影之契",
                function: function () {
                    showPremade("暗影之契");
                },
            },
        },
    },
    story: {
        name: "背景故事",
        id: "story",
        function: function () {
            toggleSubMenu("story-submenu"); // Toggle sub-items for this menu
        },
        subItems: {
            mermaid: {
                name: "人鱼的故事",
                function: function () {
                    jumpHere("htmls/Mermaid.html");
                },
            },
            Fire: {
                name: "烈火之门派",
                function: function () {
                    jumpHere("htmls/Fires.html");
                },
            },
            Dawn: {
                name: "破晓",
                function: function () {
                    jumpHere("htmls/Dawn.html");
                },
            },
            Storm: {
                name: "风暴之城",
                function: function () {
                    jumpHere("htmls/Storm.html");
                },
            },
            Knight: {
                name: "光辉骑士",
                function: function () {
                    jumpHere("htmls/Knight.html");
                },
            },
            Moon: {
                name: "第九轮红月",
                function: function () {
                    jumpHere("htmls/Moon.html");
                },
            },
        },
    },
    joinUs: {
        name: "加入我们",
        function: function () {
            var content =
                "<img src='images/QRCode.JPG' alt='QRcode' style='width: 100%; height: 100%;'/>";
            loadDoc("加入我们", content);
        },
    },
};

const premadeDoc = {
    迅疾如火: {
        title: "迅疾如火",
        content: [
            "来吧，为这个沉闷的战场点燃一场狂烈的火焰。与你的炽热伙伴并肩作战，在敌人还没反应过来之前，让他们在烈焰中灰飞烟灭！",
            "用低费伙伴与小型法术迅速爆发，瞬间打出毁灭性的伤害，速战速决，掌控全局。",
        ],
        code: "4111002 // 1021001 1021001 1111001 1121001 1121001 1121002 1121002 1121005 1121005 1121006 1121006 1121007 1121012 1121012 1121014 1121014 2021013 2021019 2021019 2111002 2121001 2121001 2121002 2121002 2121003 2121003 2121004 2121004 2121006 2121007 // 3021009 3121001 3121002 3121003 3121007 3121008 3121009 3121013 3121014 3121015 // 3101001",
    },
    大海无量: {
        title: "大海无量",
        content: [
            "谁能窥见大海深处的秘密？那是宝藏，是危机，还是虚无缥缈的传说？掌控无尽的波涛，掀起遮天的浪潮，征服一切。",
            "专注于发育，利用后期的大型法术统治战场，掌控局势，直达胜利巅峰。",
        ],
        code: "4211003 // 1021001 1021001 1021007 1021016 1211001 1221001 1221001 1221007 1221007 1221010 1221010 1221011 1221012 1221012 1221014 1221014 2011002 2021006 2021006 2021012 2021012 2021014 2021014 2021018 2021021 2021021 2211001 2221001 2221001 2221010 // 3221001 3221002 3221003 3221004 3221006 3221007 3221008 3221009 3221011 3221013 // ",
    },
    富饶之地: {
        title: "富饶之地",
        content: [
            "每一颗种子都蕴藏着未来的无穷潜力。一位地脉巫师拥有足够的耐心，率领你亲自栽培的伙伴，守护这片充满希望的沃土。",
            "培育不断成长的伙伴，逐步积累优势，形成不可阻挡的压制力，最终统治战局。",
        ],
        code: "4411001 // 1011003 1411001 1421002 1421003 1421003 1421004 1421004 1421005 1421005 1421009 1421009 1421010 1421010 1421012 1421012 2011002 2021002 2021009 2021019 2021019 2411001 2421001 2421001 2421002 2421002 2421006 2421007 2421007 2421010 2421010 // 3021004 3421002 3421003 3421004 3421005 3421006 3421010 3421011 3421012 3421013 // 1401001 3001002",
    },
    风暴之息: {
        title: "风暴之息",
        content: [
            "迅猛而致命，精准而无情。狂风呼啸，雷声低鸣。整个战场将被风暴洗礼，你的对手已经无处可逃。",
            "通过大量过牌掌控资源，灵活使用各种加成，打出高效伤害，击溃你的对手。",
        ],
        code: "4311002 // 1311002 1311003 1321001 1321001 1321002 1321002 1321003 1321003 1321006 1321008 1321008 1321010 1321010 1321011 1321011 1321012 2021006 2021019 2021019 2311001 2311002 2321001 2321001 2321004 2321005 2321005 2321006 2321006 2321007 2321007 // 3321001 3321002 3321003 3321004 3321005 3321007 3321008 3321011 3321013 3321014 // 3301001",
    },

    破晓时分: {
        title: "破晓时分",
        content: [
            "纵然黑暗笼罩，光辉的战士从不会退缩，破晓的光芒终将刺破漫漫长夜。大法师，今夜，我们听令于你。",
            "通过召唤光辉的伙伴，不断为“破晓”法术叠加威力，逆转局势。",
        ],
        code: "4511003 // 1021005 1021005 1511002 1511003 1521003 1521003 1521004 1521004 1521005 1521005 1521006 1521006 1521007 1521007 1521009 1521009 1521011 1521012 1521012 1521015 1521015 2021003 2021019 2021019 2511001 2521002 2521002 2521005 2521008 2521008 // 3521001 3521003 3521005 3521006 3521007 3521010 3521011 3521013 3521014 3521015 // 1501001 3501001",
    },
    暗影之契: {
        title: "暗影之契",
        content: [
            "暗影的巫师，你所追求是什么？力量，知识...这都不重要。重要的是，你愿意为之付出什么代价。",
            "献祭你的伙伴，从他们的牺牲中获得黑暗之力，增强自己，直至胜利在握。",
        ],
        code: "4611001 // 1011002 1611001 1611002 1621001 1621001 1621002 1621002 1621003 1621003 1621004 1621004 1621007 1621007 1621008 1621008 1621010 1621011 1621011 1621012 1621015 2021009 2611001 2611002 2621004 2621005 2621005 2621006 2621006 2621012 2621012 // 3621002 3621004 3621005 3621007 3621008 3621010 3621011 3621012 3621013 3621015 // ",
    },
};
